tap "mhaeuser/mhaeuser"
brew "mas"
cask "1password"
cask "adobe-creative-cloud"
cask "appcleaner"
cask "arc"
cask "battery-toolkit"
cask "calibre"
cask "cyberduck"
cask "discord"
cask "figma"
cask "google-drive"
cask "handbrake"
cask "hiddenbar"
cask "iterm2"
cask "karabiner-elements"
cask "keepingyouawake"
cask "meetingbar"
cask "notion"
cask "obs"
cask "postman"
cask "raycast"
cask "slack"
cask "stremio"
cask "tableplus"
cask "teamviewer-quicksupport"
cask "telegram"
cask "the-unarchiver"
cask "tidal"
cask "transmission"
cask "vlc"
cask "whatsapp"
cask "zen-browser"
mas "GarageBand", id: 682658836
