brew "asdf"
brew "batt"
brew "coreutils"
brew "diff-so-fancy"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git"
brew "git-filter-repo"
brew "git-lfs"
brew "glow"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libavif"
brew "mas"
brew "neovim"
brew "ripgrep"
brew "tmux"
brew "universal-ctags"
brew "wget"
brew "yt-dlp"
cask "1password"
cask "adobe-creative-cloud"
cask "appcleaner"
cask "calibre"
cask "chatgpt-atlas"
cask "claude-code"
cask "corelocationcli"
cask "cyberduck"
cask "discord"
cask "figma"
cask "font-sauce-code-pro-nerd-font"
cask "fork"
cask "google-chrome"
cask "google-drive"
cask "granola"
cask "handbrake-app"
cask "hiddenbar"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "notion"
cask "obs"
cask "obsidian"
cask "orion"
cask "postman"
cask "raycast"
cask "slack"
cask "tableplus"
cask "tailscale-app"
cask "teamviewer-quicksupport"
cask "telegram"
cask "tidal"
cask "transmission"
cask "vlc"
cask "whatsapp"
cask "zen"
cask "zoom"
mas "Blackmagic Disk Speed Test", id: 425264550
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
