tap "mhaeuser/mhaeuser"
brew "asdf"
brew "awscli"
brew "coreutils"
brew "diff-so-fancy"
brew "ffmpeg"
brew "fswatch"
brew "fzf"
brew "gh"
brew "git-filter-repo"
brew "git-lfs"
brew "gnupg"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libavif"
brew "mas"
brew "neovim"
brew "poppler"
brew "ripgrep"
brew "tmux"
brew "universal-ctags"
brew "wget"
brew "yt-dlp"
cask "1password"
cask "adobe-creative-cloud"
cask "appcleaner"
cask "arc"
cask "mhaeuser/mhaeuser/battery-toolkit"
cask "calibre"
cask "claude"
cask "claude-code"
cask "cursor"
cask "cyberduck"
cask "discord"
cask "figma"
cask "font-geist-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-iosevka"
cask "fork"
cask "google-chrome"
cask "google-drive"
cask "handbrake-app"
cask "iterm2"
cask "karabiner-elements"
cask "keka"
cask "mactex-no-gui"
cask "notion"
cask "obs"
cask "obsidian"
cask "postman"
cask "raycast"
cask "slack"
cask "stremio"
cask "tableplus"
cask "tailscale-app"
cask "teamviewer-quicksupport"
cask "telegram"
cask "thebrowsercompany-dia"
cask "tidal"
cask "transmission"
cask "vlc"
cask "zoom"
mas "Blackmagic Disk Speed Test", id: 425264550
mas "GarageBand", id: 682658836
mas "Microsoft Excel", id: 462058435
mas "Microsoft PowerPoint", id: 462062816
